
## üìä Project: Exploring NYC Public School Test Result Scores

This notebook analyzes SAT performance data for New York City schools.
It answers three main questions:

1. Which NYC schools have the best math results?
2. What are the top 10 schools based on combined SAT scores?
3. Which borough shows the greatest variation in SAT performance?

Note: Use of **pandas** for data manipulation and analysis.

### üì• Loading the Data

Begin by importing the required library and loading the dataset containing average SAT scores for NYC schools.

In [3]:

import pandas as pd

# Load the dataset
schools = pd.read_csv("schools.csv")

# Preview the dataset
schools.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

### üßÆ Best Math Performing Schools

The maximum SAT Math score is **800**.
Define *excellent math performance* as schools scoring at least **80% of 800**, which equals **640**.

Filter schools meeting this criterion and sort them from highest to lowest math score.

In [4]:

best_math_schools = (
    schools[schools["average_math"] >= 640]
    [["school_name", "average_math"]]
    .sort_values("average_math", ascending=False)
)

best_math_schools

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683
280                     Brooklyn Technical High School           682
333                        Townsend Harris High School           680
174  High School of American Studies at Lehman College           669
0    New Explorations into Science, Technology and ...           657
45                       Eleanor Roosevelt High School           641

### üßæ Total SAT Score Calculation

To compare overall academic performance, compute a **total SAT score**
by summing the average Math, Reading, and Writing scores for each school.

In [5]:

schools["total_SAT"] = (
    schools["average_math"]
    + schools["average_reading"]
    + schools["average_writing"]
)

schools.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested,total_SAT
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN,1859
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9,1193
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1,1261
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9,1529
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7,1197

### üèÜ Top 10 Schools by Total SAT Score

Using the total SAT score, identify the **top 10 performing schools**
across all sections combined.

In [6]:

top_10_schools = (
    schools[["school_name", "total_SAT"]]
    .sort_values("total_SAT", ascending=False)
    .head(10)
)

top_10_schools

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
170                       Bronx High School of Science       2041
93                 Staten Island Technical High School       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
45                       Eleanor Roosevelt High School       1889
68   High School for Mathematics, Science, and Engi...       1889

### üèôÔ∏è Borough-Level SAT Performance Variation

Examine how SAT performance varies by **borough**.
For each borough, calculate:

- Number of schools
- Average total SAT score
- Standard deviation of total SAT score

The borough with the **largest standard deviation** shows the greatest variability in performance.

In [7]:

borough_stats = (
    schools
    .groupby("borough")["total_SAT"]
    .agg(["count", "mean", "std"])
    .round(2)
)

borough_stats

               count     mean     std
borough
Bronx             98  1202.72  150.39
Brooklyn         109  1230.26  154.87
Manhattan         89  1340.13  230.29
Queens            69  1345.48  195.25
Staten Island     10  1439.00  222.30

### üìà Borough with the Largest Standard Deviation

Finally, identify the borough with the highest SAT score variation
and format the results as required.

In [8]:

largest_std_dev = (
    borough_stats[borough_stats["std"] == borough_stats["std"].max()]
    .rename(columns={
        "count": "num_schools",
        "mean": "average_SAT",
        "std": "std_SAT"
    })
    .reset_index()
)

largest_std_dev

     borough  num_schools  average_SAT  std_SAT
0  Manhattan           89      1340.13   230.29

### ‚úÖ Summary

The notebook:
- Identified top math-performing schools
- Ranked schools using combined SAT scores
- Analyzed borough-level SAT score variation

This structured approach helps uncover academic performance patterns
across NYC schools in a clear and reproducible way.